/******************************************************************************
;  *   	@MCU				 STM32F103C8T6
;  *   	@Create Date         2023.03.22
;  *    @Official website		 http://www.devechip.com/
;  *----------------------Abstract Description---------------------------------
;  *			    								睡眠控制处理
**************************************************************************************/
#include "Sleep.h"
/**
	* @说明	打开定时睡眠
	* @参数	
	* @返回值	
	* @注	各阈值根据实际情况写入
*/
void DVC1124_Sleep(void)
{
	g_AfeRegs.R1.CST=0xE;//进入睡眠
	if(DVC11XX_WriteRegs(AFE_ADDR_R(1), 1))
	{
	
	}
}


